deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
/*
*********************************************************************************************************
*
*	模块名称 : 串口中断+FIFO驱动模块
*	文件名称 : bsp_uart_fifo.c
*	版    本 : V1.8
*	说    明 : 采用串口中断+FIFO模式实现多个串口的同时访问
*	修改记录 :
*		版本号  日期       作者    说明
*
*	Copyright (C), 2015-2030,www.autobma.com
*
*********************************************************************************************************
*/

#include "bsp.h"

/* diag counters (debug watch): index 0..5 = USART1..USART6 */
volatile uint32_t dbg_uart_ore[6];
volatile uint32_t dbg_tx_drop;
volatile uint32_t dbg_tx_cr1;
volatile uint32_t dbg_tx_isr;
volatile uint32_t dbg_tx_iser;
volatile uint32_t dbg_tx_primask;
volatile uint16_t dbg_tx_cnt;
volatile uint8_t  dbg_tx_captured;
volatile uint32_t dbg_tx_wait;
volatile uint32_t dbg_tx_wait_port;
volatile uint32_t dbg_uart_fe[6];
volatile uint32_t dbg_uart_full[6];
static uint8_t uart_idx(USART_TypeDef *u)
{
    if (u == USART1) { return 0u; }
    if (u == USART2) { return 1u; }
    if (u == USART3) { return 2u; }
    if (u == USART4) { return 3u; }
    if (u == USART5) { return 4u; }
    return 5u;
}


/* 定义每个串口结构体变量 */
#if UART1_FIFO_EN == 1
    static UART_T g_tUart1;
    static uint8_t g_TxBuf1[UART1_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf1[UART1_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART2_FIFO_EN == 1
    static UART_T g_tUart2;
    static uint8_t g_TxBuf2[UART2_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf2[UART2_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART3_FIFO_EN == 1
    static UART_T g_tUart3;
    static uint8_t g_TxBuf3[UART3_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf3[UART3_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART4_FIFO_EN == 1
    static UART_T g_tUart4;
    static uint8_t g_TxBuf4[UART4_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf4[UART4_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART5_FIFO_EN == 1
    static UART_T g_tUart5;
    static uint8_t g_TxBuf5[UART5_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf5[UART5_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART6_FIFO_EN == 1
    static UART_T g_tUart6;
    static uint8_t g_TxBuf6[UART6_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf6[UART6_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

UART_HandleTypeDef IPC_huart1;// IPCOM
UART_HandleTypeDef CH2_huart2;// CHANNEL 2
UART_HandleTypeDef CH3_huart3;// CHANNEL 3
UART_HandleTypeDef CH4_huart4;// CHANNEL 4
UART_HandleTypeDef CH5_huart5;// CHANNEL 5
UART_HandleTypeDef CH1_huart6;// CHANNEL 1

static void UartVarInit(void);
static void InitHardUart(void);
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen)
{
    uint16_t free_space;
    uint16_t i;

    /* Non-blocking: if the whole frame does not fit into TX FIFO, drop it
       (counted) instead of waiting - waiting can deadlock when interrupts
       are masked or in an ISR context. */
    free_space = (uint16_t)(_pUart->usTxBufSize - _pUart->usTxCount);
    if (_usLen > free_space)
    {
        dbg_tx_drop++;
        dbg_tx_wait_port = uart_idx(_pUart->uart);
        return;
    }

    /* Gate only this UART TXE event source; never disable the shared IRQ (RX stays live) */
    CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);

    for (i = 0u; i < _usLen; i++)
    {
        _pUart->pTxBuf[_pUart->usTxWrite] = _ucaBuf[i];
        if (++_pUart->usTxWrite >= _pUart->usTxBufSize)
        {
            _pUart->usTxWrite = 0u;
        }
        _pUart->usTxCount++;
    }

    SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);
}

static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte);
static void UartIRQ(UART_T *_pUart);



static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART4_UART_Init(void);
static void MX_USART5_UART_Init(void);
static void MX_USART6_UART_Init(void);
/*
*********************************************************************************************************
*	函 数 名: bsp_InitUart
*	功能说明: 初始化串口硬件，并对全局变量赋初值.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUart(void)
{

    UartVarInit();		/* 必须先初始化全局变量,再配置硬件 */

    InitHardUart();		/* 配置串口的硬件参数(波特率等) */

}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为UART指针
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: uart指针
*********************************************************************************************************
*/
UART_T *ComToUart(COM_PORT_E _ucPort)
{
    if (_ucPort == COM1)
    {
        #if UART1_FIFO_EN == 1
        return &g_tUart1;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM2)
    {
        #if UART2_FIFO_EN == 1
        return &g_tUart2;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM3)
    {
        #if UART3_FIFO_EN == 1
        return &g_tUart3;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM4)
    {
        #if UART4_FIFO_EN == 1
        return &g_tUart4;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM5)
    {
        #if UART5_FIFO_EN == 1
        return &g_tUart5;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM6)
    {
        #if UART6_FIFO_EN == 1
        return &g_tUart6;
        #else
        return 0;
        #endif
    }
    else
    {
        Error_Handler();
        return 0;
    }
}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为 USART_TypeDef* USARTx
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: USART_TypeDef*,  USART1, USART2, USART3, UART4, UART5，USART6，UART7，UART8。
*********************************************************************************************************
*/
USART_TypeDef *ComToUSARTx(COM_PORT_E _ucPort)
{
    if (_ucPort == COM1)
    {
        #if UART1_FIFO_EN == 1
        return USART1;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM2)
    {
        #if UART2_FIFO_EN == 1
        return USART2;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM3)
    {
        #if UART3_FIFO_EN == 1
        return USART3;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM4)
    {
        #if UART4_FIFO_EN == 1
        return USART4;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM5)
    {
        #if UART5_FIFO_EN == 1
        return USART5;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM6)
    {
        #if UART6_FIFO_EN == 1
        return USART6;
        #else
        return 0;
        #endif
    }

    else
    {
        /* 不做任何处理 */
        return 0;
    }
}

