deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
            /* 从发送FIFO取1个字节写入串口发送数据寄存器 */
            //USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
            _pUart->uart->TDR = _pUart->pTxBuf[_pUart->usTxRead];

            if (++_pUart->usTxRead >= _pUart->usTxBufSize)
            {
                _pUart->usTxRead = 0;
            }

            _pUart->usTxCount--;
        }

    }

    /* 数据bit位全部发送完毕的中断 */
    if (((isrflags & USART_ISR_TC) != RESET) && ((cr1its & USART_CR1_TCIE) != RESET))
    {
        //if (_pUart->usTxRead == _pUart->usTxWrite)
        if (_pUart->usTxCount == 0)
        {
            /* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
            //USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
            CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TCIE);

            /* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
            if (_pUart->SendOver)
            {
                _pUart->SendOver();
            }

            _pUart->Sending = 0;
        }
        else
        {
            /* 正常情况下，不会进入此分支 */

            /* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
            //USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
            _pUart->uart->TDR = _pUart->pTxBuf[_pUart->usTxRead];

            if (++_pUart->usTxRead >= _pUart->usTxBufSize)
            {
                _pUart->usTxRead = 0;
            }

            _pUart->usTxCount--;
        }
    }

    /* 清除中断标志 */
    if ((isrflags & USART_ISR_ORE) != RESET) { dbg_uart_ore[ui]++; }
    if ((isrflags & USART_ISR_FE) != RESET) { dbg_uart_fe[ui]++; }
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_PEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_FEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_NEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_OREF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_IDLEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_TCF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_CTSF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_CMF);

//	*            @arg UART_CLEAR_PEF: Parity Error Clear Flag
//  *            @arg UART_CLEAR_FEF: Framing Error Clear Flag
//  *            @arg UART_CLEAR_NEF: Noise detected Clear Flag
//  *            @arg UART_CLEAR_OREF: OverRun Error Clear Flag
//  *            @arg UART_CLEAR_IDLEF: IDLE line detected Clear Flag
//  *            @arg UART_CLEAR_TCF: Transmission Complete Clear Flag
//  *            @arg UART_CLEAR_LBDF: LIN Break Detection Clear Flag
//  *            @arg UART_CLEAR_CTSF: CTS Interrupt Clear Flag
//  *            @arg UART_CLEAR_RTOF: Receiver Time Out Clear Flag
//  *            @arg UART_CLEAR_CMF: Character Match Clear Flag
//  *            @arg.UART_CLEAR_WUF:  Wake Up from stop mode Clear Flag
//  *            @arg UART_CLEAR_TXFECF: TXFIFO empty Clear Flag
}

/*
*********************************************************************************************************
*	函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler等
*	功能说明: USART中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1

void USART1_IRQHandler(void)
{
    UartIRQ(&g_tUart1);
}

#endif

#if UART2_FIFO_EN == 1

void USART2_IRQHandler(void)
{
    UartIRQ(&g_tUart2);
}

#endif

#if UART3_FIFO_EN == 1

void USART3_6_IRQHandler(void)
{
    uint32_t fl;
    fl = USART3->ISR; if ((fl & (USART_ISR_RXNE | USART_ISR_ORE | USART_ISR_TXE | USART_ISR_TC)) != 0u) { UartIRQ(&g_tUart3); }
    fl = USART4->ISR; if ((fl & (USART_ISR_RXNE | USART_ISR_ORE | USART_ISR_TXE | USART_ISR_TC)) != 0u) { UartIRQ(&g_tUart4); }
    fl = USART5->ISR; if ((fl & (USART_ISR_RXNE | USART_ISR_ORE | USART_ISR_TXE | USART_ISR_TC)) != 0u) { UartIRQ(&g_tUart5); }
    fl = USART6->ISR; if ((fl & (USART_ISR_RXNE | USART_ISR_ORE | USART_ISR_TXE | USART_ISR_TC)) != 0u) { UartIRQ(&g_tUart6); }
}

#endif




/*
*********************************************************************************************************
*	函 数 名: fputc
*	功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f)
{
    #if 1	/* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
    comSendChar(COM1, ch);

    return ch;
    #else	/* 采用阻塞方式发送每个字符,等待数据发送完毕 */
    /* 写一个字节到USART1 */
    USART1->TDR = ch;

    /* 等待发送结束 */
    while((USART1->ISR & USART_ISR_TC) == 0)
    {}

    return ch;
    #endif
}

/*
*********************************************************************************************************
*	函 数 名: fgetc
*	功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

    #if 1	/* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
    uint8_t ucData;

    while(comGetChar(COM1, &ucData) == 0);

    return ucData;
    #else

    /* 等待接收到数据 */
    while((USART1->ISR & USART_ISR_RXNE) == 0)
    {}

    return (int)USART1->RDR;
    #endif
}



static void MX_USART1_UART_Init(void)
{

    /* USER CODE END USART1_Init 1 */
    IPC_huart1.Instance = USART1;
    IPC_huart1.Init.BaudRate = UART1_BAUD;
    IPC_huart1.Init.WordLength = UART_WORDLENGTH_8B;
    IPC_huart1.Init.StopBits = UART_STOPBITS_1;
    IPC_huart1.Init.Parity = UART_PARITY_NONE;
    IPC_huart1.Init.Mode = UART_MODE_TX_RX;
    IPC_huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    IPC_huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    IPC_huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    IPC_huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&IPC_huart1) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART1->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART1->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART1->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

