deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

    /* USER CODE END USART2_Init 1 */
    CH2_huart2.Instance = USART2;
    CH2_huart2.Init.BaudRate = UART2_BAUD;
    CH2_huart2.Init.WordLength = UART_WORDLENGTH_8B;
    CH2_huart2.Init.StopBits = UART_STOPBITS_1;
    CH2_huart2.Init.Parity = UART_PARITY_NONE;
    CH2_huart2.Init.Mode = UART_MODE_TX_RX;
    CH2_huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH2_huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    CH2_huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH2_huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH2_huart2) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART2->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART2->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART2->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
}

/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART3_UART_Init(void)
{


    CH3_huart3.Instance = USART3;
    CH3_huart3.Init.BaudRate = UART3_BAUD;
    CH3_huart3.Init.WordLength = UART_WORDLENGTH_8B;
    CH3_huart3.Init.StopBits = UART_STOPBITS_1;
    CH3_huart3.Init.Parity = UART_PARITY_NONE;
    CH3_huart3.Init.Mode = UART_MODE_TX_RX;
    CH3_huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH3_huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    CH3_huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH3_huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;


    if (HAL_UART_Init(&CH3_huart3) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART3->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART3->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART3->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}

/**
  * @brief USART4 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART4_UART_Init(void)
{



    /* USER CODE END USART4_Init 1 */
    CH4_huart4.Instance = USART4;
    CH4_huart4.Init.BaudRate = UART4_BAUD;
    CH4_huart4.Init.WordLength = UART_WORDLENGTH_8B;
    CH4_huart4.Init.StopBits = UART_STOPBITS_1;
    CH4_huart4.Init.Parity = UART_PARITY_NONE;
    CH4_huart4.Init.Mode = UART_MODE_TX_RX;
    CH4_huart4.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH4_huart4.Init.OverSampling = UART_OVERSAMPLING_16;
    CH4_huart4.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH4_huart4.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH4_huart4) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART4->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART4->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART4->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}

/**
  * @brief USART5 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART5_UART_Init(void)
{



    /* USER CODE END USART5_Init 1 */
    CH5_huart5.Instance = USART5;
    CH5_huart5.Init.BaudRate = UART5_BAUD;
    CH5_huart5.Init.WordLength = UART_WORDLENGTH_8B;
    CH5_huart5.Init.StopBits = UART_STOPBITS_1;
    CH5_huart5.Init.Parity = UART_PARITY_NONE;
    CH5_huart5.Init.Mode = UART_MODE_TX_RX;
    CH5_huart5.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH5_huart5.Init.OverSampling = UART_OVERSAMPLING_16;
    CH5_huart5.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH5_huart5.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;



    if (HAL_UART_Init(&CH5_huart5) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART5->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART5->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART5->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}

/**
  * @brief USART6 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART6_UART_Init(void)
{

    /* USER CODE END USART6_Init 1 */
    CH1_huart6.Instance = USART6;
    CH1_huart6.Init.BaudRate = UART6_BAUD;
    CH1_huart6.Init.WordLength = UART_WORDLENGTH_8B;
    CH1_huart6.Init.StopBits = UART_STOPBITS_1;
    CH1_huart6.Init.Parity = UART_PARITY_NONE;
    CH1_huart6.Init.Mode = UART_MODE_TX_RX;
    CH1_huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH1_huart6.Init.OverSampling = UART_OVERSAMPLING_16;
    CH1_huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH1_huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH1_huart6) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART6->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART6->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART6->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}


uint16_t uart_recv(COM_PORT_E _ucPorts, void *buf, uint32_t len)
{
    uint16_t i = 0;
    uint8_t rdata = 0;
    uint8_t *rptr = (uint8_t*)buf;

    for( i = 0; i < len; i++)
    {
        if(comGetChar(_ucPorts, &rdata))
        {
            rptr[i] = rdata;
        }
        else
        {
            break;
        }

    }

    return i;
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
